{
    "family law":"Reddy & Reddy is well known for is expertise in family law related matters including divorce (mutual and petitioned), guardianship, marital rights, premarital agreements, parental rights and obligations, Streedhan, succession, etc. We represent clients in family law related litigation, mediation and arbitration.0",
    "business": "Our team has extensive expertise in money recovery disputes through litigation, and arbitration. We regularly represent money lenders, including NBFCs, in recovery proceedings against corporate as well as individual borrowers.

We conduct title searches, vetting of documents for loan, drafting of various agreement for banking and non-banking financial institutes.

We also regularly advise our clients on corporate bankruptcy, recapitalization, debt restructuring, parallel policy and other restructuring compliance related issues. We also negotiate and draft all finance and lease related matters, provide restructuring and securitization schemes, and offer assistance in liquidation, insolvency and bankruptcy.

Reddy & Reddy also advises on foreign investment policies and compliances, but also on investment schemes abroad by Indian companies and wealthy individuals.",
"environment": "Reddy & Reddy offers legal compliance and due diligence services in the field of environmental and other regulatory laws.

We ensure that our corporate clients are in compliance with all environmental, safety, health, sanitory and phytosanitory legal requirements across sectors.

Our team keeps a close check of the fast moving legal landscape in environmental and regulatory law. We also represent our clients in matters related to environmental hazards, and other environment and health related disputes, and we obtain the required licenses and government clearances and licenses.

We regularly represented corporate clients, including MNCs, in proceedings before before the National Green Tribunal. We also advise and represent NGOs and individual environtmentalists on issues relating to pollution, environmental hazards etc.

",
"arbitary":"ur team comprises experienced and resourceful advocates and lawyers who advise and represent our clients in all dispute resolution forums. We have previously represented our clients in arbitral proceedings involving complex commercial disputes on various subject matters including insurance law,consumer law, government construction contracts, contractual breach etc.

We also have experience in litigation in support of arbitral proceedings,including application for interim relief, judicial appointment of arbitrator and challenge of award.",

}